arcticicestudio.nord-visual-studio-code
esbenp.prettier-vscode
matangover.mypy
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
PKief.material-icon-theme
usernamehw.errorlens
vscodevim.vim
